import React from "react";
import {useRouter} from "next/router";
import Style from "../../src/assets/stylesheet/blog.module.scss";
import Layout from "../../src/components/HomePage/Layout/Layout";
import {numberFormat} from "../../src/utilities";

const blogData = [
    {
        key: 1,
        title: 'آینده آموزش با تدریس آنلاین چگونه رقم می خورد؟',
        single_title: `تدریس آنلاین | ویژگی‌ها، مزایا و عواملی که در آینده آن نقش دارند`,
        desc: `مفهوم آموزش و تدریس در چند سال گذشته، با ظهور و گسترش اینترنت و تکنولوژی‌های جدید دستخوش تغییرات بنیادین شده است. حالا دیگر تنها راه یادگیری حضور فیزیکی در کلاس نیست و مفهومی به نام تدریس آنلاین نیز به وجود آمده است. `,
        day: '16',
        month: 'آذر',
        year: '1399',
        image_url: '/blog/images/future_of_online_education/singleMain.png',
        backgroundColor: '#3f53d9',
        text:
            <>
                <p>
                    در این مطلب به آینده این نوع از تدریس پرداخته و سعی می‌کنیم با بررسی جوانب گوناگون آن، درکی از این
                    آینده
                    به دست بیاوریم. استفاده از تکنولوژی‌های جدید در آموزش سابقه به نسبت طولانی دارد. در دهه‌ گذشته
                    «مدارس
                    هوشمند» ایجاد شده‌اند که از قابلیت‌های تکنولوژی‌های جدید برای آموزش بهتر دانش‌آموزان استفاده
                    می‌کنند.
                    آموزش آنلاین گام بعدی در پیشرفت آموزش محسوب می‌شود. با گسترش همه‌گیری کرونا و افزایش خطر سرایت آن در
                    فضای جمعی و ارتباط فیزیکی، ارتباطات به شکل کلی دستخوش تغییراتی جدی شد. این تغییرات در یکی از
                    مهم‌ترین
                    زمینه‌های ارتباطی یعنی کلاس‌های آموزش، و تدریس نیز تاثیر قابل توجهی داشت. به همین دلیل نظام‌های
                    آموزشی
                    در کشورهای مختلف به سرعت شروع به استفاده از ابزارهای تدریس آنلاین برای پیشگیری از خطرات بیماری، و در
                    عین
                    حال ارائه خدمات آموزشی امن کردند.
                </p>
                <h3>تدریس آنلاین چیست؟</h3>
                <p>
                    تدریس آنلاین را می‌توان به سادگی استفاده از ابزارهای ارتباطی آنلاین برای تدریس و آموزش در نظر گرفت.
                    در مواردی برای این کار از ابزارهای و پلتفرم‌های اختصاصی استفاده می‌شود که برای این کار بهینه‌سازی
                    شده‌اند. برای مثال، در آنها امکاناتی برای مدیریت کلاس آنلاین توسط معلم یا مربی گنجانده شده است تا
                    این فرایند به شکل سنتی خود نزدیک‌تر شود.
                    اما به صورت کلی هر نوع ارتباط آموزشی دو طرفه یا تعاملی از طریق اپلیکیشن‌ها و شبکه‌های ارتباطی در این
                    حوزه قرار می‌گیرد. امروزه به خصوص پس از شیوع کرونا، شاهد خیزش و محبوبیت بیش از پیش این نوع از آموزش
                    هستیم. نه فقط مدارس و دانش‌آموزان، که بسیاری از آموزش‌های تخصصی، آموزش‌های فنی کارمندان، و حتی
                    دوره‌های آموزش عالی دانشگاه‌های معتبر حالا به صورت آنلاین ارائه می‌شود.
                    برای این نوع از آموزش دسترسی دانش‌آموزان به ابزارهای ارتباطی فضای مجازی کفایت می‌کند. آنها با داشتن
                    یک دستگاه موبایل یا تبلت می‌توانند به کلاس متصل شده و از مزایای آن استفاده کنند. این نوع از تدریس به
                    تدریس سنتی یا آفلاین مزایای زیادی دارد که در ادامه بعضی از مهم‌ترین آنها را معرفی می‌کنیم.
                </p>
                <img src="/blog/images/future_of_online_education/desktop_computer.png"/>
                <h3>مزایای تدریس آنلاین</h3>
                <p>پلتفرم‌های آموزشی تازه‌ای در چند ماه گذشته ایجاد شده‌اند که هر یک تاکید خود را بر بخش‌های مختلفی از
                    تجربه آموزشی گذاشته‌اند. در مجموع یک پلتفرم مناسب آموزش آنلاین دارای برخی از امکانات و ویژگی‌ها است
                    که مزایای آن بر روش‌های سنتی را تشکیل می‌دهد. از جمله مزایای تدریس آنلاین که نقش مهمی در آینده این
                    نوع از تدریس ایفا می‌کنند می‌توان به موارد زیر اشاره داشت.</p>

                <ol className={Style.list}>
                    <li>
                        <b>راحتی و انعطاف تدریس آنلاین: </b>
                        <span> بدون تردید اولین مزیتی که هنگام فکر کردن به آموزش آنلاین به آن توجه می‌کنیم راحتی و انعطاف آن است. دیگر نیازی به حضور دانش‌آموز در محل کلاس نیست. به این ترتیب   دانش‌آموزان می‌توانند از داخل اتاق خود در خانه به کلاس درس متصل شده و آموزش ببینند. به این
                            ترتیب نه
                            نیازی به آماده‌سازی کیف مدرسه و کتاب‌ها هست، نه نیازی به رفتن مسیر خانه تا مدرسه، و نه
                            والدین نگرانی
                            دوری فرزندانشان و مشکلاتی مثل آلودگی آنها به ویروس کرونا و مسائلی مانند این را دارند.
                        </span>
                        <p>
                            این قابلیت در آموزش بزرگسالان نیز کارایی بسیار زیادی دارد. امروزه بیشتر دوره‌های مهارتی
                            موسسات معتبر
                            بین‌المللی به شکل درس‌گفتارهای آنلاین ارائه می‌شود. به این ترتیب افرادی که قصد آموزش ضمن
                            اشتغال
                            دارند و می‌خواهند با به روز کردن مهارت و سطح دانش خود جایگاه شغلی مناسب‌تری کسب کنند،
                            می‌توانند بدون
                            نگرانی از وقت نداشتن در این دوره‌ها ثبت نام کنند. آنها می‌توانند در ساعت‌های بیکاری خود به
                            کسب این
                            مهارت‌ها بپردازند.
                        </p>
                    </li>

                    <li>
                        <b>تعامل با کیفیت استاد-شاگرد: </b>
                        <span>

تدریس آنلاین نه فقط تعامل بین معلم و دانش‌آموز یا استاد و شاگرد در حین تدریس را کاهش نمی‌دهد، بلکه کیفیت آن را تا حد زیادی هم افزایش می‌دهد. معلم‌ها از روش‌های مختلفی برای تدریس استفاده می‌کنند و به خوبی می‌توانند از موقعیت تدریس با ابزارهای آنلاین
                            بهترین بهره
                            را ببرند. علاوه بر این، آنها می‌توانند خیلی بیشتر از کلاس سنتی روی هر یک از دانش‌آموزان
                            متمرکز شوند.
                            با استفاده از این نوع تدریس دانش‌آموزان می‌توانند هر زمان که سوالی داشتند آن را مطرح کرده و
                            پاسخ آن
                            را دریافت کنند. معلم‌ها به این ترتیب به راحتی می‌توانند متوجه نقطه نگاه فردی دانش‌آموزان شده
                            و
                            رویکرد خود را با آنها هماهنگ سازند.
                        </span>
                        <p></p>
                    </li>
                    <li>
                        <b>کلاس‌ها ظرفیت دانش‌آموزان بیشتری خواهند داشت: </b>
                        <span> یکی دیگر از مزایای کاملا روشن تدریس آنلاین امکان افزایش تعداد دانش‌آموزان بدون بروز مشکلاتی است که این کار در کلاس‌های سنتی ایجاد می‌کند. </span>
                        <p>
                            امروزه بسیاری از دوره‌های محبوب در دانشگاه‌های معتبر بین‌المللی ظرفیت پذیرش صدها و هزاران
                            دانشجو به صورت همزمان را دارند. این اتفاق در بسیاری از کنفرانس‌ها و ورک‌شاپ‌های تخصصی نیز
                            روی می‌دهد. این ویژگی نقش مهمی در آینده تدریس آنلاین دارد چرا که مستقیما محدودیت‌های فیزیکی
                            تدریس سنتی را نشانه گرفته است.
                        </p>

                    </li>
                    <li>
                        <b>افزایش محبوبیت آموزش وب‌محور: </b>
                        <span> آموزش وب‌محور شامل انواع کنفرانس‌ها، ورک‌شاپ‌ها، سمینار و وبینارهای تخصصی، برنامه‌های گفتگو، مصاحبه و امثال این می‌شود که متقاضی بدون نیاز به حضور فیزیکی می‌تواند در آنها شرکت کرده و آموزش ببیند. با گسترش شیوع کرونا و برقرار قواعد فاصله‌گذاری
                            اجتماعی، جذابیت این نوع از آموزش افزایش زیادی پیدا کرده است. گرایش به ثبت نام در این دوره‌ها
                            در چند ماه گذشته رشد قابل توجهی داشته است. </span>
                        <p>
                            به این ترتیب می‌توانیم انتظار داشته باشیم که این رویکرد نقش مهمی در آینده تدریس آنلاین ایفا
                            کند. حالا دیگر یکی از بهترین راه‌های آموزش جستجوی دوره‌ها و تخصص‌ها به شکل آنلاین و ثبت نام
                            در آنها است. با این کار افراد می‌توانند بدون توجه به درگیری‌ها و مشاغل روزمره، وضعیت آموزشی
                            خود را بهبود ببخشند. این رویکرد بدون تردید در آینده رشد بیشتری هم خواهد داشت.
                        </p>
                    </li>

                    <li>
                        <b>تدریس آنلاین مقرون به صرفه است: </b>
                        <span> هزینه آموزش آنلاین و شرکت در کلاس‌های آن نسبت به تدریس سنتی ارزان‌تر است. دلیل این موضوع کاهش هزینه‌های فیزیکی آموزشگاه، مدرسه یا موسسه آموزشی است. </span>
                        <p>دانش‌آموزان و شاگردان با داشتن یک دستگاه موبایل یا تبلت که قابلیت دسترسی به ابزارهای ارتباط
                            مجازی را به آنها بدهد، می‌توانند به کلاس متصل شده و آموزش ببینند.
                            <br/>
                            گذشته از کاهش هزینه‌های رفت و آمد یا هزینه‌های حضور فیزیکی افراد، آنلاین شدن آموزش امکان
                            دسترسی افراد بیشتر به محتوای آموزشی محبوب‌تر را نیز فراهم می‌کند. اگر تا پیش از این امکان
                            حضور تمام دانش‌آموزان در کلاس اساتید محبوب وجود نداشت و هزینه این کلاس‌ها به همین دلیل
                            افزایش می‌یافت، حالا امکان حضور دانش‌آموزان بیشتری در یک کلاس با استفاده از تدریس آنلاین
                            وجود دارد. به این ترتیب می‌توان ادعا کرد کاهش هزینه‌ها در این مورد می‌تواند به افزایش کیفیت
                            نیز منجر شود.
                        </p>
                    </li>
                    <li>
                        <b>افزایش نرخ یادگیری: </b>
                        <span> طبق تحقیقاتی که در این زمینه صورت گرفته، نرخ یادگیری در دوره‌های آنلاین بهتر از دوره‌های سنتی آموزشگاهی است. این موضوع به احتمال زیاد به دلیل کاهش موارد استرس‌زا و       فشارهایی است که آموزش در کلاس‌های سنتی به وجود می‌آورد. این نوع از تدریس به دانش‌آموزان امکان
                            می‌دهد مطابق ریتمی که با آن راحت‌تر هستند آموزش ببینند. علاوه بر این، مواد آموزشی آنها دیگر
                            به شکل موقت ارائه نمی‌شود و هر گاه بخواهند می‌توانند به اطلاعات روی تخته دسترسی پیدا
                            کنند. </span>
                        <p>

                        </p>
                    </li>
                </ol>

                <img src="/blog/images/future_of_online_education/blackboard_on_keyboard.png"/>

                <h3>آینده تدریس آنلاین در یک نگاه</h3>
                <p>:به این ترتیب ۶ مزیت اصلی این نوع از تدریس که به آنها پرداختیم شامل موارد زیر می‌شود</p>
                <ol className={Style.list}>
                    <li>راحتی و انعطاف تدریس آنلاین</li>
                    <li>تعامل با کیفیت استاد-شاگرد</li>
                    <li>کلاس‌ها ظرفیت دانش‌آموزان بیشتری خواهند داشت</li>
                    <li>افزایش محبوبیت آموزش وب‌محور</li>
                    <li>تدریس آنلاین مقرون به صرفه است</li>
                    <li>افزایش نرخ یادگیری</li>
                </ol>
                <p>
                    این عوامل باعث می‌شوند هنگامی که راجع به آینده آموزش آنلاین صحبت می‌کنیم به آن به عنوان یک پیشرفت
                    مهم در زمینه تدریس نگاه کنیم. این آموزش با حذف موانع فیزیکی و گذر از محدودیت‌هایی از این دست، تاکید
                    بسیار بیشتری روی کیفیت آموزش دارد. به این ترتیب دانش‌آموزان و مهارت‌آموزان با داشتن امکان ارتباط از
                    طریق شبکه‌های مجازی یا اتصال به پلتفرم‌های آموزشی می‌توانند به محتوای آموزشی با بالاترین کیفیت
                    دسترسی داشته باشند.
                    <br/>
                    با این حساب اینکه در آینده بسیاری از مشکلات آموزشی که برخواسته از موقعیت و شرایط
                    فیزیکی بودند بر طرف شوند، تصوری منطقی است. حالا معلم‌ها می‌توانند بیشترین حد از تمرکز را روی نحوه
                    انتقال محتوای آموزشی بگذارند و نیازی به توجه به مدیریت فیزیکی کلاس نداشته باشند.
                </p>
                <h3>تکنولوژی‌های تدریس آنلاین</h3>
                <p>
                    به صورت کلی هر نوع ابزار ارتباطی که جایگزین حضور فیزیکی معلم و دانش‌آموزان در یک فضا شود از جمله این
                    تکنولوژی‌ها محسوب می‌شود. با این حال تکنولوژی‌های ویژه‌ای برای این منظور طراحی شده‌اند که هر یک از
                    آنها در زمینه‌ خاصی قابلیت دارد. بعضی از آنها برای برقراری کلاس درس کارایی مناسبی دارند حال آنکه
                    بعضی دیگر در برقرار ویدئو کنفرانس یا مدیریت کلاس و نظارت بر فعالیت‌ها قابلیت بیشتری دارند.
                </p>
                <h3>تکنولوژی‌های برگزاری کلاس</h3>
                <p>این ابزارها اجازه می‌دهند کلاس در یک زمان مشخص با حضور دانش‌آموزان از نقاط مختلف تشکیل شود و در آن امکان تعامل بین طرفین وجود داشته باشد. بعضی از محبوب‌ترین این تکنولوژی‌ها برای تدریس آنلاین شامل موارد زیر می‌شود:</p>

                <ul className={Style.listNone}>
                    <li>
                        <b>
                            گوگل کلس روم:
                        </b>
                        <span> یکی از محبوب‌ترین ابزارهای آموزش آنلاین است که همواره هم رایگان بوده است. این برنامه به سادگی با ابزارهای کمک آموزشی دیگر یکپارچه می‌شود و قابلیت‌های زیادی برای یادگیری تعاملی ایجاد می کند.</span>
                    </li>
                    <li>
                        <b>
                            تاپ هت
                            (Top Hat):


                        </b>
                        <span> یکی دیگر از پلتفرم‌های آموزشی آنلاین است که کار تشکیل کلاس را به سادگی انجام می‌دهد. این پلتفرم به معلم‌ها اجازه می‌دهد از اسلاید، پرسش‌های چند گزینه‌ای، و بحث‌های زنده استفاده کنند</span>
                    </li>
                    <li>
                        <b>کاهوت!
                            (!Kahoot):

                        </b>
                        <span> این پلتفرم برای دانش‌آموزان جذابیت بیشتری دارد چرا که به آنها امکان می‌دهد با ریتم و سرعت متناسب خود آموزش ببینند. </span>
                    </li>
                </ul>
                <h3>راه‌کارهای ویدئوکنفرانس برای تدریس آنلاین</h3>
                <p>برقراری ارتباط ویدئویی مناسب بین معلم و دانش‌آموزان یکی از نیازهای اصلی در آموزش از راه دور و آموزش آنلاین محسوب می‌شود. امروزه مدارس برای این نیاز به ابزارهای زیادی مثل موارد زیر دسترسی دارند:</p>

                <ul className={Style.listNone}>
                    <li>
                        <b>سیسکو وبکس (Cisco Webex): </b>
                        <span> شرکت سیسکو برای کمک به تدریس آنلاین پلتفرم ویدئو کنفرانس خود، وبکس را به صورت رایگان در اختیار معلم‌ها می‌گذارد. با این ابزار امکان برقراری ویدئوکنفرانس به راحتی ایجاد می شود. </span>
                    </li>
                    <li><b>پرونتو (Pronto): </b>
                    <span> این اپلیکیشن برنامه‌های چت و ویدئو را با هم تلفیق می‌کند تا به دانش‌آموزان و معلم‌ها کمک کند با هم ارتباط مجازی برقرار کنند. </span>
                    </li>
                    <li>
                        <b>آوایا(Avaya): </b>
                        <span> این پلتفرم نیز امکانات بسیار مناسبی برای آموزش آنلاین ایجاد کرده و آن را به رایگان در اختیار معلم‌ها و دانش‌آموزان قرار می‌دهد </span>
                    </li>
                    <li><b>زوم(Zoom): </b>
                    <span> یکی از محبوب‌ترین و قدرتمندترین ابزارهای ملاقات آنلاین است که خدمات ویدئوکنفرانس با کیفیت بسیار بالایی ارائه می‌دهد. این اپلیکیشن قبلا یک محدودیت 40 دقیقه‌ای برای حساب‌های رایگان داشت، که حالا برای تسهیل آموزش آن را برداشته است. داشت، که حالا برای تسهیل آموزش آن را برداشته است. </span>
                    </li>
                </ul>
                <h3>ابزارهای مدیریتی و ارتباطی تدریس آنلاین</h3>
                <p>برای اینکه تدریس به درستی انجام شود، لازم است که معلم‌ها ابزارهای مدیریتی مناسب را در اختیار داشته باشند. برای این کار بعضی از محبوب‌ترین نرم‌افزارهای رایگان شامل موارد زیر می‌شوند:</p>
                <ul>
                    <li>
                        <b>مایکروسافت تیمز: </b>
                        <span> این ابزار امکان همکاری آنلاین همزمان بر اساس مجموعه‌ای از متون و اپلیکیشن‌ها را ایجاد می‌کند. ظرف ماه‌های گذشته استفاده از این ابزار حدود 500% افزایش داشته است.  </span>
                    </li>
                    <li>
                        <b>رفتر (Raftr):</b>
                        <span> این ابزار ارتباطی حالا برای مقاطع بالاتر از دبیرستان رایگان است. با استفاده از این ابزار امکان ساختن نامحدود گروه‌های آموزشی وجود دارد. </span>
                    </li>
                    <li>
                        <b>بیسک(Bisk): </b>
                        <span> بیسک به مدارس کمک می‌کند برنامه‌ریزی‌های استراتژیک خود را دنبال کنند، برنامه‌های جدید آنلاین ایجاد کنند، و بر اساس تقاضا به دانش‌آموزان پشتیبانی بدهند. بیسک همچنین دوره‌های آموزشی رایگان برای معلم‌ها نیز برگزار می‌کند.  </span>
                    </li>
                </ul>
                <img src="/blog/images/future_of_online_education/cloud_education.png"/>
                <h3>سخن پایانی</h3>
                <p>
                    با شیوع ویروس کرونا و برقراری محدودیت‌های اجتماعی به واسطه آن، گرایش به تدریس آنلاین افزایش چشم‌گیری پیدا کرده است. مدارس و آموزشگاه‌های دولتی و خصوصی در ایران و بسیاری از کشورهای دنیا شروع به استفاده از امکانات اینترنت و تکنولوژی‌های ارتباط مجازی برای برقراری کلاس‌های درس مجازی کرده‌اند. این کلاس‌ها اغلب به صورت همزمان بین معلم و شاگردان برگزار شده و آنها از داخل منازل خود در این کلاس‌ها حاضر می‌شوند. حالا کلاس‌ها می‌توانند بدون خطر آلودگی به ویروس کرونا برگزار شوند.
                    <br />
                    این نوع از تدریس مجموعه‌ای از ویژگی‌ها و مزایا دارد که در این مطلب سعی کردیم آنها را معرفی کنیم. کاهش استرس و فشار دانش‌آموزان، افزایش تمرکز معلم روی فرد فرد آنها، کاهش هزینه‌های رفت و آمد، کاهش هزینه‌های کلاس و همچنین افزایش نرخ یادگیری، از جمله مزایایی است که در همین مدت کوتاه استفاده از این نوع آموزش شناخته شده‌اند. بدون شک این شروع دوران جدیدی از آموزش است که در آن یادگیری دروس و مهارت‌ها به شکلی مستقیم‌تر و در عین حال منعطف‌تر انجام می‌شود.
                </p>
            </>

    },
    {
        key: 2,
        title: 'مزایای سیستم آموزش آنلاین',
        single_title: 'مزایای سیستم آموزش آنلاین',
        desc: 'در این آموزش شما به‌طور ۲۴ ساعته به منابع دسترسی دارید، شما قادر هستید که متناسب با ویژگی‌های خودتان، گام بردارید یعنی اگر سریع یاد می‌گیرید، می‌توانید سریع‌تر درس را تمام کنید.',
        day: '16',
        month: 'آذر',
        year: '1399',
        image_url: '/blog/images/benefits_of_online_education/singleMain.png',
        backgroundColor: '#00dbb5',
        text:
        <>
        <p>فرض کنید اگر شما یک فرد شاغل باشید برای شرکت در یک کلاس احتمالاً بایستی یک روز در هفته‌ی خود را خالی کنید که به موسسه‌ی آموزشی موردنظر بروید و ثبت‌نام کنید و به‌احتمال خیلی بیشتر شروع کلاس‌های شما به اول ترم بعد، یا هنگامی‌که تعداد افراد کافی برای شروع کلاس ثبت‌نام کرده باشند، موکول می‌شود.
 اما همین کار را برای یک کلاس آموزش الکترونیکی شاید بتوان در کمتر از یک ساعت انجام داد. از طرف دیگر، وقتی شما در یک کلاس آموزش سنتی که حضور فیزیکی لازمه انجام آن است شرکت می‌کنید، فقط در همان زمان مقرر کلاس می‌توانید چیزهای جدید یاد بگیرید و مشکلات خود را حل کند. اگر چیزی را یاد نگرفتید و یا چیزی را فراموش کردید، بایستی تا کلاس بعدی صبر کنید. اما در آموزش الکترونیکی شما به‌طور ۲۴ ساعته به منابع دسترسی دارید، شما قادر هستید که متناسب با ویژگی‌های خودتان، گام بردارید یعنی اگر سریع یاد می‌گیرید، می‌توانید سریع‌تر درس را تمام کنید. اگر دیرتر یاد می‌گیرید، می‌توانید تا جایی که دوست دارید مطالب را مرور کنید</p>

<h3>انعطاف‌پذیر و سیار</h3>
<p>
یادگیری الکترونیکی LMS بسیار انعطاف‌پذیر است. چون تقریباً می‌توان گفت که در هر زمان و مکانی که میخواهید به صورت کلاس مجازی کار را انجام دهید. بنابراین خیلی‌ها می‌توانند از این موضوع بهره‌مند شوند. از کارمندی که وقت مناسبی برای رفتن به کلاس ندارد، تا افرادی که در نقاط دوردستی نسبت به کلان‌شهرها هستند و برای آموزش نیاز دارند به کلان‌شهری سفر کنند.
این موضوع خود می‌تواند باعث کمتر شدن تراکم جمعیتی در کلان‌شهرها شود که یکی از مشکلات مهم امروز جامعه‌ی ایرانی است. انعطاف‌پذیری این نوع آموزش برای افرادی که به دلیل تعهدات شغلی یا شخصی قادر به شرکت کردن در یک کلاس رسمی نیستند, محیط آموزشی مناسبی را فراهم می‌آورد تا مثلا برای کسانی که در ساعات متغیر کار می‌کنند یا اشخاصی که به دلیل استراحت در منزل شانس حضور در دانشگاه را ندارند درحالی‌ که دیگران در همان زمان در کلاس‌ها شرکت می‌کنند. این روش انتخاب خوبی برای اشخاصی است که چه از نظر مخارج و یا وقت برای ادامه تحصیل امکان سفر به خارج از کشور را ندارند.
شما به هیچ دستیار یا استادی وابسته نیستید.
<br/>
هیچ قانون سخت  و خاصی درباره آموزش وجود ندارد، حتی اخر هفته ها نیز می توانید آموزش ببینید و تمرین کنید.
از طریق چت ها و بحث های گروهی ، می توانید آموزش های خود را با سایرین به اشتراک بگذارید و یا سوالات خود را پاسخ دهید.

</p>
<img src="/blog/images/benefits_of_online_education/laptop_and_book.png"/>

<h3>به روز بودن محتوا در سیستم آموزش مجازی  LMS</h3>

<p>
سرعت عرضه و تولید محتوای الکترونیکی در سیستم LMS نسبت به محتوای چاپی و فیزیکی بیشتر است و خیلی سریع می توان محتوای جدید را به دانش پذیران عرضه کرد. حال آنکه تغییر محتوای آموزشی چاپی به علت هزینه های بالای تولید و عرضه محتوا سخت است و این تغییر دیر انجام می شود. این اتفاق باعث شده برای برخی حوزه ها که محتوای آموزشی مدام عوض می شود (مثل آموزش نرم افزارها) دیگر استفاده از محتوای چاپی و فیزیکی هیچ توجیهی نداشته باشد.


</p>
<h3>
آموزش مجازی در هزینه ها صرفه جویی می کند
</h3>
<p>
آموزش اینترنتی هم به موسسات آموزشی و هم به دانشجویان کمک می کند. کالج ها مجبور نیستند برای تحصیل دانش آموزان مکان همراه با وسایل اضافی دیگر فراهم کنند. دانش آموزان هم مجبور نیستند برای کسب مهارت های جدید و دانش جدید رفت و آمد داشته باشند. البته توجه کنید که آموزش اینترنتی هم مستلزم این است که معلمان برای ایجاد دوره های آموزشی سخنرانی ها و کلاس های خود را ضبط کنند، این مواد یادگیری می تواند برای مدت زمان طولانی مورد استفاده قرار گیرد و در صورت نیاز، به راحتی تغییر کند. بنابراین، کالج ها پول را برای مدرسان و استادان نیز صرف می کنند.(کاهش %50 صرفه جویی در زمان و کاهش %60 صرفه جویی در هزینه ها)
</p>

<h3>اموزش مجازی دسترسی به دانش را افزایش می دهد</h3>
<p>برای برخی از افراد سفر به کشوری دیگر تنها برای یادگیری چیزی غیرممکن است، به ویژه اگر قصدشان تنها یادگیری یک موضوع خاص باشد نه اخذ مدرک دانشگاهی. آموزش اینترنتی این فرآیند را به میزان قابل توجهی ساده تر می کند، به دانشجویان سراسر جهان اجازه می دهد که دوره های ایجاد شده توسط بهترین دانشگاه های جهان را آموزش ببینند. این امر به دانشجویان بومی نیز کمک می کند، به آنها اجازه می دهد تا در حین مطالعه با افرادی که از فرهنگ های مختلف می آیند ارتباط برقرار کنند. مطمئنا کالج هایی هستند که تجربه چند فرهنگی را نیز ارائه می دهند، اما آنها به اندازه سایت های آموزش آنلاین متنوع نیستند.</p>

<h3>جذابیت بصری و شنیداری </h3>
<p>اکثر محتوای آموزش مجازی به روش های جدید و جذاب بصری و دیداری ساخته می شود و از کسل کنندگی و یکنواختی کتاب های قدیمی دیگر خبری نیست. همین اتفاق شور و انرژی دانش پذیران (به ویژه دانش پذیران جوان و نوجوان) را برای آموزش افزایش می دهد و از خستگی در اثر مطالعه زیاد کم می کند.</p>
       <h3>امکان طراحی برنامه درسی توسط هر دانشجو منطبق با نيازشخصی</h3>
       <p>در آموزش از طريق لوح هاي فشرده، دانشجويان تنها مي توانند از مطالب درسی که از قبل بر روی يک لوح ذخيره شده استفاده کنند اما در آموزش از طريق وب عملا هيچ محدوديتی از بابت حجم اطلاعات قابل دسترسی وجود ندارد. يک برنامه ايده آل آموزش از طريق وب، بايد به گونه اي طراحی شده باشد که مطالب درسی در آن به قسمتهای مختلف تقسيم شده باشند و دانشجو بتواند متناسب با نياز خود، به اطلاعات لازم دسترسی پيدا کند. در اين روش مطالب به راحتی قابل به روز رسانی هستندكه شايد اين خصوصيت را بتوان مهمترين مزيت آموزش از طريق وب ناميد.
در زمانی که تحولات اقتصادی در سطح جهان به سرعت به وقوع مي پيوندد، برنامه هاي آموزشی نيز نياز به تغيير و تطبيق مداوم با نيازهای روز دارند. در روش استفاده از لوحهاي فشرده و ساير روش های آموزش از راه دور، با هر تغيير، بايستی لوح فشرده جديدی تهيه و تکثير شود و از طريق پست برای همه دانشجويان ارسال گردد در حالی که در روش آموزش از طريق وب، دانشجويان هربارکه به آدرس سايت مراجعه مي‌کنند، مي توانند ازجديدترين منابع استفاده كنند.

</p>
        </>
    },
    {
        key: 3,
        title: 'تاریخچه آموزش مجازی',
        single_title: 'تاریخچه آموزش مجازی',
        backgroundColor:'#050038',
        desc: `کلمه آموزش مجازی یا vitrual learning و یا به عبارت دیگر آموزش الکترونیکی e-learning خیلی زود در سایت های مختلف جا افتاد و افراد زیادی از این سیستم برای انتقال دانش خود استفاده کردند . `,
        day: '16',
        month: 'آذر',
        year: '1399',
        image_url: '/blog/images/history_of_online_education/singleMain.png',
        text:
        <>
            <p>این آموزش ها در ابتدا به صورت سایت های ساده html ساخته می شد و در اختیار کاربران قرار می گرفت ، ولی رفته رفته وبلاگ های شخصی امکان ساخت فضای رایگان را در اختیار عموم قرار دادند و افراد زیادی با  استفاده از  این وبلاگ ها آموزش های خود را ساخته و در اختیار دیگران قرار می دادند.
<br/>
با مطالعه و بررسی تاریخچه آموزش مجازی به این موضوع خواهیم رسید که مدرسه مجازی

Virtual Class 
از مدرسه واقعی و دانشگاه مجازی
Virtual University 
از دانشگاه واقعی مجزا نمی باشند. با تفحص در 
تاریخچه سیستم آموزش مجازی، هر دو مورد را مبتنی بر تجربه‌های موارد مشابه در دنیای واقعی می یابیم یعنی در سامانه آموزش مجازی و آموزش اینترنتی نیز تلاش می شود همه عناصر دانشگاهی و کلاسی که در دانشگاه واقعی وجود دارد در نرم افزار یادگیری الکترونیکی و کلاس آنلاین
lms
در زمانی مشخص می‌توانند در یک فضای زنده به برقراری ارتباط با استاد بپردازند . خصیصه ویژه این نوع از آموزش برخورداری از چند فرهنگی، چند مکانی و چند ظرفیتی بودن ماهیت کلاس مجازی
Virtual Class 
می باشد. نرم افزار های
e-learning 
در دانشگاه مجازی بستر مناسبی‌ برای‌ ظهور و بروز استعدادها، خلاقیت‌ و نوآوری‌ها مهیا کرده است.
</p>
<img src="/blog/images/history_of_online_education/smart_school_on_monitor.png"/>
<p> فناوری‌ اطلاعات‌ و انواع نرم افزار آموزش مجازی lms سبب افزایش‌ کارایی‌ فرآیند آموزش‌ می‌گردد و از  مهم‌ترین ‌دستاوردهای‌ آن می‌توان‌ به‌ موارد زیر اشاره‌ کرد:</p>
<p>بهبود چشمگیر کیفیت‌ یادگیری با نرم افزار یادگیری الکترونیکی و بالاتر رفتن آموخته‌های‌ دانش‌آموزان‌ و دانشجویان‌</p>
<p>تسهیل در بدست آوردن حجم‌ بسیار بالایی‌ از اطلاعات‌ و دانش‌های‌ موجود با آموزش مجازی در جهان</p>
<p>یادگیری الکترونیکی سریع و به‌ موقع‌ و بدست آوردن‌ اطلاعات‌ در زمان‌ بسیار اندک‌</p>
<p>
کاهش پیدا کردن‌ بعضی از هزینه‌های‌ آموزشی‌ با مدیریت آموزش الکترونیکی
</p>
<p>بالا رفتن کیفیت‌، دقت‌ و صحت‌ مطالب‌ درسی‌ و علمی‌ با سیستم مدیریت آموزش lms</p>
<p>ارتقای‌ علمی‌ دانش‌آموزان‌ و دانشجویان‌ با پیاده سازی آموزش الکترونیکی</p>
        </>
    
    },
    {
        key: 4,
        title: 'استراتژی‌های اساسی برای یادگیری موفق آنلاین',
        single_title: 'استراتژی های اساسی برای یادگیری موفق آنلاین',
        titleColor:'#000',
        desc: `برای بهبود تدریس آنلاین چه مواردی باید رعایت شود؟ 
آیا به تازگی وارد حوزه آموزش الکترونیکی شده اید؟ یا به دنبال راه کارهایی برای بهبود روش های تدریس آنلاین خود هستید؟`,
        day: '16',
        month: 'آذر',
        year: '1399',
        image_url: '/blog/images/strategies_of_online_education/singleMain.png',
        backgroundColor:'#fde870',
        text:
        <>
            <p>دوره های آموزش آنلاین به یک روش فوق العاده تبدیل شده است که دانش آموزان و کارمندان برای پیشرفت در تحصیلات یا پیشرفت در حرفه خود استفاده می کنند. تدریس آنلاین در یک کلاس مجازی به روش های متفاوتی نسبت به روش های کلاس سنتی نیاز دارد، بنابراین مهم است که معلمان مهارت های خود را با محیط یادگیری آنلاین سازگار کنند یا و حتی مهارت های جدیدی کسب کنند، تا قادر باشند مطالب خود را به صورت موثر و جذابی برای دانش پذیر ها ارائه دهند. در ادامه این مقاله، به 5 استراتژی خواهیم پرداخت که می توانید آن ها را برای بهبود تدریس آنلاین خود به کار بگیرید و دوره آموزش الکترونیکی خود را به یک تجربه موفق برای خود و فراگیران خود تبدیل کنید.
دوره آموزشی خود را به یک تجربه موفق تبدیل کنید.
</p>

<h3>دانش پذیران خود را به صورت آنلاین درگیر و جذب کنید</h3>
<p>

بدون حضور جسمی شما در کلاس، ضروری است که در همان ابتدای دوره و کلاس مجازی یک ارتباط مجازی قوی برقرار کنید و حس حضور خودتان به عنوان آموزگار را به درستی انتقال دهید. معلمان آنلاین باید از همان ابتدا و همچنین در طول دوره، دانش آموزان را درگیر نگه دارند. این برای حفظ یک جامعه یادگیری موثر ضروری است.
<br/>
با ایجاد این حس حضور معلم، به دانش آموزان نشان می دهید که قابل مشاهده و هم در دسترس هستید. شما همچنین باید از آن ها به مناسبت حضورشان در یک جامعه و محیط یادگیری جدید استقبال کنید و دقیقا مانند کلاس سنتی به آن ها خوش آمد بگویید.
<br/>
به دانش آموزان خود اطلاع دهید که چه روزها و در چه بازه های زمانی آنلاین خواهید بود و اینکه چگونه می توانند در خارج از آن ساعات با شما تماس بگیرند.
<br/>
با استفاده از پست های آنلاین، فروم ها یا رسانه های اجتماعی با جامعه یادگیری خود در ارتباط باشید و از این ابزار برای درگیر کردن آن ها نسبت به دوره آموزش انلاین و محتوای آموزش استفاده کنید، چرا که آن ها وقتی ببینند که معلم ها خود در بحث ها شرکت می کند، بیشتر جذب می شوند و آن ها نیز بیشتر مشارکت می کنند. با استفاده از این تعامل، شما همچنین می توانید با دانش پذیرهای خود روابطی در زمینه های حرفه شان برقرار کنید و تجربه یادگیری آن ها را بسیار شخصی تر و به یاد ماندنی کنید.
</p>

<img src="/blog/images/strategies_of_online_education/strategy_of_online_eucation.png"/>

<h3>یک محیط یادگیری حمایتی ایجاد کنید</h3>
<p>به عنوان یک معلم آنلاین، شما می توانید یک انجمن آنلاین حمایتی را برای فراگیران خود ایجاد کنید.
<br/>
بهترین راه برای دستیابی به این هدف، تشویق تعامل های بین معلم ها با دانش آموزان و همچنین تعامل های دانش آموزان با یکدیگر است. دکتر جودیت بوتچر، یک از محققین برجسته در زمینه آموزش الکترونیکی و یادگیری مبتنی بر وب، راه کار های زیر را برای ایجاد این تعامل ها پیشنهاد می دهد
</p>
<p>
در شروع دوره آنلاین خود، یک پست را به معرفی شخصی اختصاص دهند، و از شرکت کننده ها بخواهید که خود و زندگی خود را به صوت کوتاه برای بقیه معرفی کنند.
</p>
<p>یک تالار گفت و گو ایجاد کنید که دانش پذیر ها بتوانند در آن ها از همدیگر کمک بگیرند و سوالات و پاسخ های خود را ارسال کنند و در طول دوره آموزشی از یادگیری هم دیگر حمایت کنند.</p>
      <p>گروه های کوچکی برای حمایت بهتر از دانش پذیر ها ایجاد کنید، مشابه با گروه های مطالعه سنتی.</p>
      <p>استفاده از این استراتژی ها، دانش پذیرها را ترغیب می کند تا به عنوان یک عضو فعال در جامعه یادگیری فعالیت کنند و این مزایایی را برای همه افراد درگیر ایجاد می کند.</p>
      <h3>برای مشارکت بهتر از ترکیبی از ابزارهای یادگیری استفاده کنید</h3>
      <p>خوشبختانه امروزه دیگر فن آوری ابزارهای زیادی برای ایجاد محیط های یادگیری مجازی در اختیار ما قرار داده است که به ما امکان دستیابی به همان تعامل و همکاری که در کلاس حضوری می توان داشت را در کلاس آنلاین نیز می دهند، حتی بهتر از آن.
 <br />
 فعالیت های متنوعی که اکنون به صورت آنلاین امکان پذیر است، ایجاد انواع مختلفی از محیط های یادگیری موثر را ممکن می سازد.
بهترین معلم های آموزش آنلاین هم از فعالیت های هم زمان و هم غیر هم زمان استفاده می کنند و ترکیبی از سبک های سنتی یادگیری آنلاین را با ابزارهای صوتی و تصویری جدید تر و با قابلیت اشتراک گذاری بیشتر ایجاد می کنند. کار با ترکیب فعالیت های مختلف باعث جذاب تر و جالب تر شدن مطالب می شود و باعث افزایش تعامل دانش پذیر ها باهم و با معلم ها می شود.
</p>
<h3>به صورت مداوم به دانش پذیر های خود بازخورد ارائه دهید</h3>
<p>ارائه بازخورد یکی از مولفه های اساسی برای کلیه محیط های یادگیری از جمله یادگیری آنلاین است.
<br/>
به عنوان یک معلم آنلاین ، بازخورد شما به ایجاد یک تجربه یادگیری الکترونیکی که برای یادگیرنده آموزنده ، جذاب و انگیزشی باشد، کمک می کند. بازخورد شما باید در طول فرایند آموزش الکترونیکی مداوم باشد، و در اسرع وقت ارائه شود تا دانش آموزان بتوانند به روشنی تشخیص دهند که کدام رفتارها یا مهارت هایشان باید بهبود یابد.
<br/>
شما می توانید با طراحی تمرین های مشارکتی، بازخوردهای گروهی نیز ارائه دهید. این به بهبود تعامل در بین افراد یک کلاس آنلاین نیز کمک می کند.</p>
<h3>محتوای آموزش الکترونیکی موبایلی ایجاد کنید</h3>
<p>معلم های آنلاین باید متوجه اهمیت یادگیری موبایلی باشند، زیرا اکثر دانش آموزان و کارکنان اکنون عادت دارند که از تلفن همراه خود برای امر یادگیری استفاده کنند.
<br/>
یادگیری موبایلی مزایای کلیدی دارد چه برای آموزش دانش پذیرها -دانش آموزان و دانشجویان- و چه برای آموزش کارکنان. تدریس آنلاین به آن ها امکان دسترسی به مطالب درسی به روز و مطالب مربوطه را در هر کجا و در هر زمان می دهد. برنامه های یادگیری موبایلی اکثرا به بخش های بسیار کوچک که به سرعت و به راحتی قابلیت خواندن هستند تقسیم می شوند. یادگیری موبایلی به عملکرد و بهره وری نیز کمک می کند.
از ریسپانسیو بودن محتوای الکترونیکی خود اطمینان حاصل کنید. به این ترتیب که مطمئن شوید دوره های اموزش مجازی شما و آزمون آنلاین مربوط به آن نمایش کاربر پسندی در تلفن های همراه هوشمند، لپ تاپ ها و آی پد ها داشته باشند. با این کار به دانش پذیرهای خود این اطمینان را می دهید که با نیازها و امکانات فعلی آن ها و نیازهای نیروی کار مدرن آشنا هستید و به آن اهمیت می دهید.
<br/>
با به کار گیری این استراتژی ها می توانید نسبت به کیفیت آموزش انلاین، آزمون انلاین و مطالب الکترونیکی خود و نتایج آن ها اطمینان بیشتری داشته باشید. همچنین خواهید دانست که در حال ایجاد یک فضای یادگیری مثبت تر و مشترک تر برای دانش آموزان خود هستید.
</p>
        </>
    }, {
        key: 5,
        title: 'چند نکته برای یادگیری موثر آنلاین',
        single_title: 'چند نکته برای یادگیری موثر آنلاین',
        titleColor:'#000',
        desc: `این روزها یادگیری مهارت‌های جدید به واسطه آموزش آنلاین بیش از هر زمان دیگری ساده شده است. تکنولوژی‌های ارتباطی و رسانه‌ای روز به روز گسترش یافته‌اند.`,
        day: '16',
        month: 'آذر',
        year: '1399',
        backgroundColor:'#ededed',
        image_url: '/blog/images/online_education_notes/singleMain.png',
        text:
        <>
            <p>دسترسی به محتوا اجازه داده است که شکل آموزش نسبت به سال‌های گذشته تغییراتی اساسی را تجربه کند.
<br/>
دسترسی به اینترنت طی دو دهه گذشته به بشر اجازه داده است تا مفاهیم جدیدی را در حوزه‌های گوناگون خلق کند.
<br/>
یکی از این مفاهیم جدید آموزش الکترونیکی، آموزش آنلاین یا آموزش مجازی است.
<br/>
امروزه یک سامانه آموزش مجازی در قالب یک وب‌سایت آموزش آنلاین فرصتی برابر برای بسیاری از اقشار جامعه فراهم می‌کند؛ و در موارد متعددی، در حوزه گستره آموزش و تعداد دانشجویان، نقشی پر رنگ‌تر از دانشگاه‌های مطرح دارد.
<br/>
بستر بسیاری از آموزش‌های آنلاین به کمک ویدئوهای آموزشی شکل گرفته است.
<br/>
آموزش‌های ویدئویی فرصتی جذاب برای یادگیری موضوعی هستند؛ چراکه امکان ارتباطی نسبتا نزدیک به واقعیت را فراهم کرده و علاوه بر آن مزیت‌هایی را ارائه می‌کنند که در آموزش سنتی وجود ندارد.</p>
        <img src="/blog/images/online_education_notes/studying_math_online.png"/>

        <h3>نکاتی مهم برای بهبود یادگیری از طریق ویدئوهای آموزشی</h3>
        <ol className={Style.list}>
                    <li>
                        <b>از امکان تکرار استفاده کنید: </b>
                        <span>ویدئوها به ما اجازه می‌دهند که به میزان دل‌خواه یک آموزش یا بخشی از آن را تکرار کنیم.تکرار چندین و چند باره یک موضوع ساده‌ترین مزیت آموزش از طریق ویدئو است که در عین  سادگی می‌تواند در یادگیری بهتر بسیار موثر باشد.
همچنین بنا به نوع آموزش، می‌توانید دوره‌های تکرار آموزش‌ها را منظم کرده و برنامه‌ریزی مشخصی برای آن داشته باشید.</span>

</li>
<li>
    <b>در صورت امکان ویدئوهای مدنظر را از سایت آموزش آنلاین دانلود کنید:</b>
    <span>دانلود کنید تا آن را حتی در زمان نبود دسترسی به اینترنت نیز همراه خود داشته باشید. این کار علاوه بر کاهش هزینه‌های اتصال به  اینترنت، اجازه می‌دهد ویدئوها را در هر موقعیتی همراه خود داشته باشید. به خصوص با وجود گوشی‌های هوشمند، این فرصت خوبی است که در زمان‌های مرده و بدون استفاده (مثل حضور در وسائل حمل و نقل عمومی) نیز امکان تماشای این ویدئوها را داشته باشید.</span>
</li>
<li>
    <b>مراقبت باشید که آموزش ویدئویی شما را تنبل نکند:</b>
    <span>گاهی دسترسی بیش از حد موجب تنبلی می‌شود. مثلا با فرض اینکه این آموزش همیشه در دسترس است؛ زمان خوبی برای مطالعه آن در نظر نمی‌گیریم و یا  در صورت مشاهده ویدئو، تمرکز لازم برای یادگیری را نخواهیم داشت. در این زمینه پیشنهاد می‌کنیم حتما ویدئوها را با جدیت دنبال کنید و حداقل یک مرتبه آنها را با تمرکز کامل مشاهده نمایید.</span>
</li>
<li>
    <b>نکته برداری از آموزش‌های ویدئویی را فراموش نکنید:</b>
    <span>دسترسی سریع‌تر به نکات مهم در هر حالتی ضروری است. بنابراین توصیه می‌کنیم در اولین سری تماشای ویدئوی آموزشی، قلم و کاغذی را برای ثبت نکات مهم در کنار خود داشته باشید. این روش کمک می‌کند تا بتوانید در زمان‌های کوتاه مروری سریع بر ویدئوی آموزشی داشته باشید. البته این نکته برداری را می‌توانید در رایانه یا گوشی هوشمند خود نیز انجام دهید.</span>
</li>
<li>
    <b>از امکانات ساده پلیر ویدئو استفاده کنید:</b>
    <span>اکثر بخش‌کننده‌های ویدئویی چند امکان ساده اما مفید را در اختیار شما قرار می‌دهند. متوقف کردن ویدئو، افزایش و کاهش سرعت پخش ویدئو به میزان دلخواه، پرش  چند ثانیه‌ای روی ویدئو و... است. اینکه هریک از این امکانات چگونه به شما کمک می‌کند؛ بسته به روش استفاده شما و نوع آموزش دارد.
مثلا در آموزش ‌های مهارتی، تکرار بخشی از ویدئو و یا کند کردن سرعت پخش، می‌تواند بسیار مفید باشد.</span>
</li>
</ol>

        </>
    },

];


function search(nameKey, myArray) {
    for (let i = 0; i < myArray.length; i++) {
        if (myArray[i].title === nameKey) {
            return myArray[i];
        }
    }
}

export default function SingleBlog() {
    const router = useRouter();
    const {slug} = router.query;
    const [data, setData] = React.useState(search(slug.split('-').join(' '),blogData));

    return (
        <Layout>

        <div className={Style.singleBlogContainer}>
            <div className={Style.headerContainer} style={{backgroundColor:data.backgroundColor , color:data.titleColor}}>
                <div className={Style.blogTitle}>
                    <h3>{numberFormat.toPersianDigits(data.single_title)}</h3>
                </div>
                <div className={Style.blogImage}>
                    <img src={data.image_url} alt={data.title}/>
                </div>
                <div className={Style.blogDate}>
                    <span>{numberFormat.toPersianDigits(data.day)}</span>
                    <span>{numberFormat.toPersianDigits(data.month)}</span>
                    <span>{numberFormat.toPersianDigits(data.year)}</span>
                </div>
                <div className={Style.blogDesc}>
                    <p>{numberFormat.toPersianDigits(data.desc)}</p>
                </div>

            </div>

            <div className={Style.bodyContainer}>
                {data.text}
            </div>

        </div>
        </Layout>
    )
}