import React, { useEffect, useRef, useState } from 'react';
import { Typography, useTheme, useMediaQuery } from '@material-ui/core'
import Layout from "../../src/components/HomePage/Layout/Layout";
import classes from "../../src/assets/stylesheet/terms.module.scss";
import Head from "next/head";
import LayoutWithSidebar from '../../src/components/Kit/Layouts/LayoutWithSidebar';
import clsx from 'clsx';
import typography from "../../src/components/Kit/Style/kits.module.scss";

const sidebarItems = [
    { title: 'خدمات چیستا', link: 'services' },
    { title: 'شرایط و محدودیت ها', link: 'license' },
    { title: 'هزینه ها و پرداخت', link: 'prices' },
    { title: 'گارانتی و تضمین', link: 'guarantee' },
    { title: 'مسئولیت محدود', link: 'limited' },
    { title: 'پرداخت غرامت', link: 'Compensation' },
    { title: 'استفاده های مجاز', link: 'validUsage' },
    { title: 'حقوق و اقدامات', link: 'rights' }
]

function Terms() {
    const [activeMenu, setActiveMenu] = useState()
    const privacyRefs = useRef([]);
    const [darkMode, setDarkmode] = useState(true)
    const theme = useTheme();
    const isTablet = useMediaQuery(theme.breakpoints.down(800));
    const handleScroll = () => {
        let currentScrollPos = window.pageYOffset;

        if (currentScrollPos < 50) {
            setDarkmode(true)
        } else {
            setDarkmode(false)
        }
    }

    useEffect(() => {
        window.addEventListener('scroll', handleScroll);
        return () => window.removeEventListener('scroll', handleScroll);
    });

    return (
        <Layout darkMode={darkMode}>
            <Head>
                <title>قوانین و مقررات - چیستا</title>
            </Head>
            <div className={classes.privacyHeader}>
                <h2 className={`${typography.lineHeight} ${typography.fontFamB}`}>قوانین و مقررات چیستا</h2>
            </div>
            <LayoutWithSidebar>
                <div className={classes.sidebar}>
                    {isTablet &&
                        <>
                            <Typography className={typography.fontFamB} variant="h1"> شرایط استفاده از چیستا</Typography>
                            <Typography className={clsx(classes.updateTime, typography.fontFamR)}>این توافق‌نامه آخرین بار در تاریخ ۱ تیر ۱۴۰۰ به‌روزرسانی شده است</Typography>
                        </>
                    }
                    <ul>
                        {
                            sidebarItems.map((item, index) => (
                                <div
                                    className={classes.sidebarMenuItemLink}
                                    onClick={() => {
                                        setActiveMenu(item.link);
                                        privacyRefs.current[index].scrollIntoView({ behavior: 'smooth' })
                                    }}
                                >
                                    <li
                                        className={clsx(
                                            classes.sidebarMenuItem,
                                            (activeMenu == item.link || (item.link == 'defenition' && activeMenu == null)) && classes.sidebarMenuItemActive
                                        )}
                                    >
                                        <Typography className={clsx(classes.sidebarMenuItemText, typography.fontFamR)}>
                                            {item.title}
                                        </Typography>
                                    </li>
                                </div>
                        ))}
                    </ul>

                </div>
                <div className={classes.content}>
                    {!isTablet &&
                        <>
                            <Typography className={typography.fontFamB} variant="h1"> شرایط استفاده از چیستا</Typography>
                            <Typography className={clsx(classes.updateTime, typography.fontFamR)}>این توافق‌نامه آخرین بار در تاریخ ۱ تیر ۱۴۰۰ به‌روزرسانی شده است</Typography>
                        </>
                    }
                    <div className={classes.privacyContentItem} ref={(el) => (privacyRefs.current[0] = el)}>
                        <h3 className={clsx(typography.fontFamB, classes.privacyItemTitle)}> خدمات چیستا</h3>
                        <Typography>
                            مشتری می تواند با خدمات  <b> چیستا </b>  از فن‌آوری ارتباطات آنلاین و بورد  <b> چیستا </b>  برای برقراری ارتباطات زنده و برگزاری کلاس آموزشی یا جلسات یا به اشتراک‌گذاری اطلاعات با مخاطبین، خود مطابق با مفاد ذکر شده در بخش ۷ "استفاده های مجاز" همین توافق‌نامه بهره‌برداری نماید.  <b> چیستا </b>  خدمات خود را بر بستر شبکه‌های اینترانت داخلی کشور جمهوری اسلامی ایران و اینترنت بین‌المللی ارایه می‌نماید و خود تامین‌کننده این زیرساخت ها نیست. خدمات  <b> چیستا </b>  جایگزین سایر ابزارهای ارتباطی مانند شبکه سراسری مخابرات و شبکه‌های تلفن همراه نبوده بلکه به عنوان یک مکمل جهت همگانی نمودن فن‌آوری ارتباطات آنلاین فراهم گردیده است.
                        </Typography>
                    </div>
                    <div className={classes.privacyContentItem} ref={(el) => (privacyRefs.current[1] = el)}>
                        <h3 className={clsx(typography.fontFamB, classes.privacyItemTitle)}>شرایط لایسنس و محدودیت ها</h3>
                        <Typography>
                            شرایط و ضوابط مندرج در این توافق‌نامه همراه با فرم سفارش (در ادامه تشریح شده است) و سایر توافق‌نامه‌های دیگری که در بخش "توافق‌نامه‌ها"ی  <b> چیستا </b>  ارایه گردیده‌اند، در مجموع قرارداد کامل میان شرکت رهروان دانایی  <b> چیستا </b>  (از این پس به اختصار " <b> چیستا </b> " نامیده می‌شود) و شخص حقیقی و یا حقوقی درخواست‌کننده خدمات که در فرم سفارش شناخته می‌گردد (از این پس به اختصار "مشتری" نامیده می‌شود) را تشکیل می‌دهند. این قرارداد بر کلیه خدمات، امکانات، وب‌سایت‌ها و سرویس‌های  <b> چیستا </b>  (از این پس به اختصار "خدمات" نامیده می‌شوند) که بر پایه محصولات  <b> چیستا </b>  به مشتری ارایه می‌گردند حاکم خواهد بود. در این توافق‌نامه "فرم سفارش" به معنای درخواست مکتوب مشتری یا سفارش الکترونیکی (که ممکن است از طریق ارسال ایمیل، پیام الکترونیکی، خرید آنلاین و… ارایه گردد) جهت استفاده از خدمات  <b> چیستا </b>  است. با امضا و یا تایید الکترونیکی فرم سفارش، مشتری متعهد می‌گردد که این توافق‌نامه و سایر توافق‌نامه‌های  <b> چیستا </b>  را به دقت مطالعه نموده و با درک کامل و به‌صورت آگاهانه موافقت خود را با تمامی مفاد آن (ها) اعلام می‌نماید. ایجاد حساب کاربری توسط مشتری و استفاده از هرگونه خدمات  <b> چیستا </b>  به منزله پذیرش و قبول کلیه توافق‌نامه‌های  <b> چیستا </b>  خواهد بود
                        .
                        </Typography>
                        <Typography>
                            کلیه خدمات  <b> چیستا </b>  که در قالب سرویس‌های مختلف در اختیار مشتری قرار می‌گیرند و یا در قبال خرید یک یا چند محصول  <b> چیستا </b>  برای مشتری به‌صورت اختصاصی راه‌اندازی می‌گردند شامل شرایط و ضوابط زیر
                            هستند
                            :
                        </Typography>
                        <Typography>
                             <b> چیستا </b>  مالکیت خدمات خود را به مشتری واگذار نمی‌نماید. خدمات  <b> چیستا </b>  تنها برای بهره‌برداری مشتری در چهارچوب قرارداد راه‌اندازی شده و هرگونه تولید مشابه، فروش مجدد و یا توزیع خدمات که خارج از ضوابط این قرارداد باشند ممنوع بوده و منجر به مجازات مدنی و کیفری خواهد شد و متخلفین تحت پیگرد قانونی قرار خواهند گرفت
                        .
                        </Typography>
                        <h4>حقوق مالکیت معنوی</h4>
                        <Typography>
                            مشتری اطلاع دارد که خدمات و محصولات مرتبط با آن جزو دارایی های  <b> چیستا </b>  و موسسین آن بوده و مشمول قوانین حقوقی جمهوری اسلامی ایران هستند. ازاین‌رو مشتری حق هیچ‌گونه دخل و تصرف در خدمات (مانند حذف کپی رایت، لوگو، عنوان، لینک و…) را ندارد. همچنین حق تغییر، ویرایش، واگذاری به غیر، مهندسی معکوس، تلاش برای دستیابی به کدهای اصلی (Source code) و یا de-compile محصولات و خدمات  <b> چیستا </b>  را ندارد
                       .
                        </Typography>
                        <h4>واگذاری خدمات به اشخاص ثالث</h4>
                        <Typography>
                            مشتری می‌تواند از خدمات  <b> چیستا </b>  به عنوان زیرساخت جهت توسعه فعالیت‌های خود و کسب درآمد بهره‌برداری نماید و با امکانات فراهم شده از سوی  <b> چیستا </b>  ضمن مدیریت خدمات فراهم شده بخشی از آن را به‌صورت کنترل شده و محدود در اختیار شخص ثالث حقیقی و یا حقوقی قرار دهد ولی حق واگذاری کل خدمات ارایه‌شده از سوی  <b> چیستا </b>  را به شخص ثالث حقیقی و یا حقوقی ندارد
                        .
                        </Typography>
                        <h4>حق به‌روزرسانی و ارتقای خدمات</h4>
                        <Typography>
                            مشتری می‌تواند از یک یا تمامی تغییرات خدمات که به منظور رفع مشکلات و بهبود عملکرد خدمات تحت عنوان "به‌روزرسانی (Updates)" از سوی  <b> چیستا </b>  برای تمامی مشتریان عرضه می‌گردند در طی اشتراک خدمات  <b> چیستا </b>  به‌صورت رایگان استفاده نماید. با این وجود  <b> چیستا </b>  بابت تغییرات خدمات که به منظور افزودن امکانات جدید، ارتقای امکانات فعلی و یا عرضه نسخه جدید خدمات که تحت عنوان "ارتقا (Upgrades)" از سوی  <b> چیستا </b>  عرضه می‌گردند، پیش از فراهم نمودن دسترسی مشتری به تغییرات مذکور مجاز به دریافت هزینه خواهد بود. مشتری آگاهی کامل دارد که  <b> چیستا </b>  ممکن است خدمات خود را به صلاحدید خود در هر زمان به‌روزرسانی نماید و هیچ‌گونه تعهدی مبنی بر اطلاع‌رسانی به مشتری در خصوص به‌روزرسانی‌های انجام شده نخواهد داشت
                        .
                        </Typography>
                        <h4>نگهداری اسناد</h4>
                        <Typography>
                            کلیه فایلهای بارگذاری شده در پلتفرم(بستر)  <b> چیستا </b>  در کلیه سرویسهای غیر فعال صرفا تا ۹۰ روز پس از پایان سرویس نگهداری می گردد وپس از پایان مدت مذکور بصورت اتوماتیک از سامانه حذف خواهد گردید و  <b> چیستا </b>  تعهدی در این خصوص نخواهد داشت، لذا پیشنهاد می گردد کاربران محترم نسبت به پشتیبان گیری از محتوی فایل های حساب خود قبل از منقضی شدن مدت مذکور اقدام نمایند
                       .
                        </Typography>
                        <h4>تعهدات مصرف‌کننده نهایی</h4>
                        <Typography>
                            مشتری تنها در خصوص محتوای رویدادها، حساب کاربری و هر آنچه در حین بهره‌برداری از خدمات  <b> چیستا </b>  منتقل و منتشر می‌گردد مسئول است. نحوه استفاده مشتری از خدمات  <b> چیستا </b>  مشمول مفاد این
                            توافق‌نامه و تمامی قوانین، مقررات و آیین‌نامه‌های حقوقی و قانونی منطقه‌ای، استانی، کشوری (جمهوری اسلامی ایران) و بین‌المللی خواهد بود که موارد زیر بخشی از این قوانین و مقررات هستند
                       :
                        </Typography>
                        <ol >
                            <li>
                                پست، انتشار و فراهم نمودن دسترسی به هرگونه نرم افزار و یا فایل‌های الکترونیکی و کامپیوتری که محتوی ویروس، تروجان، کرم و سایر برنامه ‌های مخرب و مضر هستند اکیدا ممنوع است
                            </li>
                            <li>
                                استفاده از خدمات در راستای هرگونه هدف غیرقانونی (سیاسی، اخلاقی، اعتقادی، دینی، تجاری وغیره) مطابق با قوانین جمهوری اسلامی ایران و قوانین بین‌المللی اکیدا ممنوع است
                            </li>
                            <li>
                                استفاده از خدمات با هدف تلاش غیرقانونی برای دسترسی غیرمجاز به سیستم‌های رایانه ای و تجهیزاتی که مشتری حق دسترسی به آن‌ها را ندارد و یا دخالت و ایجاد اختلال در سایر شبکه‌های رایانه‌ای و یا شبکه‌های مرتبط با خدمات اکیدا ممنوع است
                            </li>
                            <li>
                                تجاوز به حقوق کپی رایت، ثبت اختراع، علایم تجاری، اسرار تجاری، حقوق مالکیت، حقوق عمومی، حقوق شخصی اشخاص ثالث و یا انتشار و به اشتراک‌گذاری محتوایی که حق مالکیت آن‌ها متعلق به مشتری نبوده و مجاز به انتشار و به اشتراک‌گذاری آن‌ها نیست اکیدا ممنوع است
                            </li>
                            <li>
                                انتشار هرگونه محتوای غیرقانونی، مغایر با شئونات اسلامی، ضد دینی، آزاردهنده، افترا آمیز، توهین‌آمیز، نژادپرستانه، زشت و غیراخلاقی، سوء استفاده کننده، خشونت‌آمیز، تهدیدآمیز، رعب‌انگیز، مضر، مبتذل، ناپسند و رکیک و هرگونه مطالب قابل اعتراض اکیدا ممنوع است. مشتری موافقت خود را مبنی بر پذیرش مسئولیت استفاده کارکنان، مخاطبین، شرکای تجاری و تمامی افرادی که امکان بهره‌برداری از خدمات فراهم شده برای مشتری را دارند اعلام می‌دارد. ازاین‌رو  <b> چیستا </b>  در‌صورتی‌که به دلایلی احساس نماید رفتار مشتری در حین بهره‌برداری از خدمات  <b> چیستا </b>  موجب نقض مفاد این توافق‌نامه گردیده است حق مسدود نمودن و یا غیرفعال کردن حساب کاربری مشتری و خدمات ارایه شده به ایشان را همراه با هرگونه اقدامی که به صلاحدید خود لازم و یا مناسب بداند را دارد
                            </li>
                        </ol>
                        <h4>گذرواژه حساب‌های کاربری</h4>
                        <Typography>
                            مشتری برای استفاده از خدمات فراهم شده توسط  <b> چیستا </b>  می‌بایست یک تلفن همراه جهت ثبت‌نام و ایجاد حساب کاربری در سایت انتخاب نماید.. برای حفظ امنیت خدمات، مشتری می‌بایست حساب کاربری خود را کاملا محرمانه حفظ نماید. مشتری مجاز به استفاده از حساب کاربری شخص دیگر نبوده و نباید رمز ارسال شده به تلفن همراه خویش را در اختیار شخص دیگری قرار دهد.  <b> چیستا </b>  مسئول خسارات ناشی از استفاده شخص ثالث از حساب کاربری مشتری (با آگاهی یا بدون آگاهی مشتری) نبوده و تمامی عواقب ناشی از آن متوجه مشتری خواهد بود. اگرچه مسئولیت خسارات ناشی از استفاده شخص ثالث از حساب کاربری مشتری که ممکن است متوجه  <b> چیستا </b>  و شرکای تجاری آن گردد بر عهده مشتری بوده و مورد دادخواست قانونی قرار خواهد گرفت. همچنین تلاش برای دسترسی به حساب کاربری و خدمات دیگران مورد پیگرد قانونی قرار گرفته و جزو جرایم رایانه‌ای محسوب می‌گردد. مشتری متعهد می‌گردد از حساب کاربری خود با دقت حفاظت نماید چرا که مسئولیت هرگونه فعالیت و بهره‌برداری از خدمات  <b> چیستا </b>  متوجه صاحب حساب کاربری مربوطه (مشتری) است. مشتری متعهد می‌گردد هرگونه استفاده افراد ناشناس از حساب کاربری خود یا فعالیت‌های مشکوک به نقض امنیت حساب کاربری که شامل سرقت اطلاعات حساب کاربری یا خطر انتشار این اطلاعات است را بلافاصله به  <b> چیستا </b>  اعلام نماید
                        .
                        </Typography>
                    </div>

                    <div className={classes.privacyContentItem} ref={(el) => (privacyRefs.current[2] = el)}>
                        <h3 className={clsx(typography.fontFamB, classes.privacyItemTitle)}>هزینه ها و شرایط پرداخت</h3>
                        <Typography>
                             <b> چیستا </b>  در قبال ارایه خدمات هزینه‌هایی را به‌صورت ماهیانه، سالیانه و یا پرداخت موردی از مشتری دریافت می‌نماید. این هزینه‌ها در قالب صورت‌حساب ‌های آنلاین صادر شده و به روش‌های مختلف (واریز به
                            حساب، کارت به کارت، پرداخت آنلاین) توسط مشتری پرداخت می‌گردند. شرایط و ضوابط مالی  <b> چیستا </b>  به شرح زیر هستند
                       :
                        </Typography>

                        <ul>
                            <li>    در روش‌های پرداخت آنلاین، مشتری به درگاه‌های مستقیم و واسط بانکی متصل شده و اطلاعات مالی مشتری به هیچ عنوان در اختیار  <b> چیستا </b>  قرار نمی‌گیرند.  <b> چیستا </b>  نهایت دقت و حساسیت را در انتخاب درگاه‌های بانکی در نظر می‌گیرد اما مسئولیت امنیت اطلاعات مالی مشتری به هیچ عنوان بر عهده  <b> چیستا </b>  نبوده و صاحبان درگاه‌های پرداخت الکترونیک بر اساس توافق‌نامه‌های خود می‌بایست پاسخگوی کاربران خود از جمله مشتری  <b> چیستا </b>  باشند. با این حال در صورت بروز هرگونه مشکل امنیتی،  <b> چیستا </b>  نهایت همکاری و مشارکت را با دستگاه های قضایی و قانونی مرتبط جهت
                                رفع مشکل مشتری خواهد داشت</li>
                            <li>
                                فعال‌سازی خدمات مورد تقاضای مشتری منوط به پرداخت هزینه‌های اعلام شده در قالب صورت‌حساب است و  <b> چیستا </b>  بدون پرداخت این هزینه‌ها هیچ گونه تعهدی در خصوص ارایه خدمات به مشتری ندارد
                            </li>
                            <li>
                                پرداخت صورت‌حساب توسط مشتری هیچ‌گونه تعهدی را مبنی بر ارایه خدمات برای  <b> چیستا </b>  به همراه نداشته و  <b> چیستا </b>  می‌تواند بنا بر صلاحدید خود (عدم احراز صلاحیت مشتری، احتمال سوء استفاده از خدمات، دستورالعمل مراجع قانونی و قضایی و…) هزینه پرداخت شده را به مشتری مرجوع نموده و از ارایه خدمات امتناع نماید
                            </li>
                            <li>
                                مشتری می‌تواند در هر زمان از دریافت خدمات  <b> چیستا </b>  انصراف دهد و در صورت عدم استفاده از خدمات خریداری شده قسمتی از هزینه پرداخت شده به مشتری مسترد خواهد شد
                            </li>
                            <li>
                                مشتری می‌تواند در هر زمان نسبت به ارتقای خدمات خود درخواست نماید. در این صورت  <b> چیستا </b>  با در نظر گرفتن هزینه پرداخت شده توسط مشتری برای خدمات فعلی، میزان مصرف مشتری از خدمات فعلی و هزینه خدمات جدید مورد تقاضا، صورت‌حساب جدیدی را صادر می‌نماید که پس از پرداخت توسط مشتری، خدمات مورد تقاضا برای ایشان فعال خواهد شد
                            </li>
                            <li>
                                مشتری در هر لحظه از مدت تعیین شده خدمات می‌تواند نسبت به تمدید، تغییر و یا انصراف از دریافت خدمات اقدام نماید
                            </li>
                            <li>
                                در صورت عدم رعایت قوانین  <b> چیستا </b>  ممکن است دسترسی مشتری به حساب خود قطع شود .با قطع دسترسی مشتری به خدمات، مسدود شدن حساب کاربری و یا لغو عضویت در وب‌سایت  <b> چیستا </b> ، ممکن است نوع خدمات مشتری به سطح عمومی و رایگان کاهش یافته و یا به طور کامل قطع گردد و اطلاعاتی که مشتری در ارتباط با خدمات  <b> چیستا </b>  ذخیره نموده باشد به طور کامل توسط  <b> چیستا </b>  حذف شوند.  <b> چیستا </b>  در صورت توقف خدمات، قطع دسترسی‌ها و حذف اطلاعات مشتری به دلیل شمول هر یک از مفاد توافق‌نامه‌های  <b> چیستا </b> ، هیچ‌گونه مسئولیتی نسبت به نتایج آن نداشته و ملزم به پاسخگویی به مشتری و یا هر شخص ثالث دیگری نخواهد بود
                            </li>
                            <li>
                                 <b> چیستا </b>  در هر زمان مجاز به تغییر تعرفه‌ها و افزایش یا کاهش هزینه خدمات خود است. این تغییرات در بخش‌های مرتبط با وب‌سایت  <b> چیستا </b>  منعکس می‌گردد و مشتری در هر زمان می‌تواند با مراجعه به وب‌سایت از آخرین تغییرات تعرفه‌ها مطلع گردد. تغییر تعرفه‌ها در قراداد فعلی مشتری اثری نداشته و در صورت تمدید خدمات و یا درخواست خدمات جدید مبنای صدور صورت‌حساب قرار خواهد گرفت
                            </li>
                        </ul>
                    </div>

                    <div className={classes.privacyContentItem} ref={(el) => (privacyRefs.current[3] = el)}>
                        <h3 className={clsx(typography.fontFamB, classes.privacyItemTitle)}>گارانتی و تضمین</h3>
                        <ul className={classes.ulNoStyle}>
                            <li>
                                 <b> چیستا </b>  تضمین می‌نماید که کلیه خدمات مندرج در این توافق‌نامه به‌صورت کاملا حرفه‌ای و تخصصی فراهم شده و منطبق با مستندات تهیه شده توسط  <b> چیستا </b>  و یا محتوای مندرج در وب‌سایت  <b> چیستا </b>  خواهد بود. روش‌های عملیاتی نمودن تضمین  <b> چیستا </b>  در خصوص تعهدات مندرج در این توافق‌نامه برای مشتری و بر اساس صلاحدید  <b> چیستا </b>  می‌تواند فعال‌سازی مجدد خدمات و افزایش مدت آن بدون دریافت هزینه اضافی و یا توقف خدمات و فسخ این توافق‌نامه در قبال بازپرداخت متناسب با هزینه اشتراک و خدمات پرداخت شده توسط مشتری باشد
                            </li>
                            <li>
                                مشتری اطلاع دارد که بخش عمده ای از خدمات  <b> چیستا </b>  بر بستر اینترنت ارایه شده و کیفیت این خدمات به زیرساخت ارتباطی فراهم شده توسط دولت جمهوری اسلامی ایران وابسته است. ازاین‌رو در صورت بروز هرگونه اختلال در بسترهای ارتباطی داخل و خارج از کشور، کیفیت اینترنت و اینترنت، شبکه‌های کابلی، رادیویی، بیسیم و مخابراتی و سایر عوامل خارج از کنترل  <b> چیستا </b> ، هیچ‌گونه مسئولیتی متوجه  <b> چیستا </b>  نبوده و تا رفع عوامل مذکور کلیه اثرات ناشی از آن در خدمات  <b> چیستا </b>  غیرقابل اجتناب خواهند بود و شامل تضمین و گارانتی های خدمات نمی‌گردند.  <b> چیستا </b>  هیچ‌گونه ادعایی در خصوص بی‌عیب و نقص بودن خدمات خود و عدم بروز خطاهای مقطعی و اختلال‌های موردی در خدمات فراهم شده را ندارد
                            </li>
                            <li>
                                 <b> چیستا </b>  به هیچ عنوان مدعی متناسب بودن امکانات و قابلیت‌های خدمات با نیازهای مشتری نبوده و مشتری می‌بایست با استفاده از خدمات رایگان فراهم‌شده از سوی  <b> چیستا </b>  از کاربرد خدمات برای رفع نیازهای خود اطمینان حاصل نماید و لذا ارایه درخواست خدمات از سوی مشتری به منزله آگاهی کامل مشتری از امکانات و قابلیت‌های خدمات  <b> چیستا </b>  خواهد بود و مسئولیتی در این خصوص بر عهده  <b> چیستا </b>  نخواهد بود
                            </li>
                            <li>
                                مشتری اطلاع کامل دارد که مسئولیت هرگونه محتوا، فایل و اطلاعاتی که در حین بهره‌برداری از خدمات  <b> چیستا </b>  میان کاربران و مخاطبین مشتری ارسال و دریافت می‌گردند متوجه مشتری بوده و خسارات احتمالی وارد بر هر نوع سیستم رایانه ای و الکترونیکی و یا از دست دادن اطلاعات حاصل از دانلود و استفاده از محتوای ذکر شده بر عهده مشتری خواهد بود و  <b> چیستا </b>  هیچ‌گونه نظارت و مسئولیتی در قبال موارد ذکر شده ندارد
                            </li>
                            <li>
                                 <b> چیستا </b>  نهایت تلاش خود را برای حفظ حریم خصوصی مشتری و کاربران مشتری در محیط برگزاری رویدادها انجام داده و با ایجاد موانع امنیتی مانند نام کاربری و گذرواژه برای ورود به رویدادها، پیوندهای اختصاصی، اتاق‌های مجازی مجزا، ایزوله نمودن ارتباطات میان اتاق‌ها و رویدادها، ارایه پنل مدیریتی اختصاصی به هر مشتری و هرگونه ابزار و راهکار لازم در خصوص ارتقای امنیت و حفظ حریم خصوصی محیط رویدادها از ورود اشخاص ناشناس و غیرمجاز به خدمات مورد بهره‌برداری مشتری جلوگیری به عمل می‌آورد. با این حال از آن‌جایی‌که صدور حق دسترسی به خدمات مشتری توسط مشتری مدیریت می‌گردد لذا  <b> چیستا </b>  هیچ‌گونه مسئولیتی در خصوص سوء استفاده احتمالی اشخاص ثالث از خدمات مشتری با آگاهی یا بدون آگاهی مشتری نداشته و مشتری می‌بایست نهایت دقت و حساسیت را در استفاده صحیح از امکانات مدیریتی فراهم شده از سوی  <b> چیستا </b>  جهت بالا بردن امنیت محیط بهره‌برداری از خدمات را به کار گیرد. عدم انتشار بی رویه پیوندهای ورود به رویدادها، عدم انتشار نام کاربری و گذرواژه کاربران در بسترهای ناامن، تغییر پی در پی پیوندهای رویدادها و… از جمله تدابیر لازم برای حفظ امنیت خدمات  <b> چیستا </b>  از سوی مشتری هستند
                            </li>
                            <li>
                                ا در قالب نوشتار، تصاویر، فیلم، اسلاید، صوت و… با اهداف آموزشی، مشاوره‌ای و… است،  <b> چیستا </b>  امکان ضبط و ذخیره‌سازی این محتوا را در انحصار مشتری قرار داده و وظیفه استفاده صحیح از این امکان و مدیریت آن بر عهده مشتری خواهد بود. مشتری اطلاع کامل دارد که با وجود فراهم نبودن امکان ذخیره‌سازی و ضبط و نگهداری محتوای رویدادها برای کاربران عادی در محیط خدمات  <b> چیستا </b> ، همچنان امکان استفاده از برنامه‌ها، محصولات و نرم‌افزارهای جانبی توسط مخاطبین و ذخیره‌سازی و ضبط و نگهداری محتوای ارایه شده در رویدادها وجود داشته و قابل پیشگیری نیست. لذا در صورت انتشار آگاهانه یا غیرآگاهانه محتوای رویدادها توسط مشتری و یا شخص ثالث،  <b> چیستا </b>  هیچ‌گونه مسئولیتی را بر عهده نداشته و عواقب ناشی از آن تماما متوجه مشتری خواهد بود
                            </li>
                            <li>
                                ارانتی و تضمین ارایه شده است و مشتری صراحتا موافقت می‌نماید که از خدمات ارایه شده با مسئولیت و ریسک خود استفاده خواهد نمود
                            </li>
                        </ul>
                    </div>

                    <div className={classes.privacyContentItem} ref={(el) => (privacyRefs.current[4] = el)}>
                        <h3 className={clsx(typography.fontFamB, classes.privacyItemTitle)}>مسئولیت محدود</h3>
                        <Typography>
                            مشتری می‌پذیرد که مسئولیت استفاده از خدمات  <b> چیستا </b>  تنها بر عهده وی بوده و در صورت بروز هرگونه خسارت مادی و معنوی به تجهیزات و یا اطلاعات مشتری که در نتیجه دسترسی یا استفاده از خدمات ما به وجود آید، هیچ‌گونه مسئولیتی بر عهده  <b> چیستا </b>  نیست
                       .
                        </Typography>
                    </div>

                    <div className={classes.privacyContentItem} ref={(el) => (privacyRefs.current[5] = el)}>
                        <h3 className={clsx(typography.fontFamB, classes.privacyItemTitle)}>پرداخت غرامت</h3>
                        <Typography>
                            مشتری موافقت می‌نماید که در صورت طرح هرگونه مسئولیت، دعاوی حقوقی و کیفری و هزینه‌های ناشی از آن که شامل دستمزد وکیل نیز می‌گردد در ارتباط با هرگونه شکایت، تقاضا و ادعای خسارت از سوی
                            اشخاص ثالث که متوجه  <b> چیستا </b>  و کلیه کارکنان، کارمندان، مدیران، صاحبان، تامین‌کنندگان اطلاعات، نمایندگی ها و تمامی عوامل وابسته به  <b> چیستا </b>  گردد و به یکی از دلایل :
                        </Typography>
                        <ul>
                            <li>
                                تجاوز مشتری از حد و حدود مفاد مندرج در کلیه توافق‌نامه‌های  <b> چیستا </b> 
                            </li>
                            <li>
                                هرگونه تقلب، فریبکاری و تحریف توسط مشتری
                            </li>
                            <li>
                                ادعای نقض حقوق از سوی اشخاص ثالث بر اساس اطلاعات، داده‌ها، فایل‌ها و محتوای منتشر شده از سوی مشتری
                            </li>
                            <li>
                                به وجود آمده باشد، همه حقوق کیفری و مدنی  <b> چیستا </b>  را به رسمیت شناخته و تمامی خسارات ناشی از آن را متقبل شده و غرامت‌های اعلام شده از سوی  <b> چیستا </b>  را پرداخت نماید
                            </li>
                        </ul>
                    </div>
                    <div className={classes.privacyContentItem} ref={(el) => (privacyRefs.current[6] = el)}>
                        <h3 className={clsx(typography.fontFamB, classes.privacyItemTitle)}>استفاده های مجاز</h3>
                        <Typography>
                            این توافق‌نامه به بیان سیاست‌های مصارف قابل قبول خدمات  <b> چیستا </b>  توسط مشتریان، نمایندگی‌ها و سایر اشخاص ثالث که به خدمات  <b> چیستا </b>  دسترسی دارند می‌پردازد. این لیست کامل نبوده و صرفا گویای نمونه‌هایی از رفتارهای غیرقابل قبول از سوی  <b> چیستا </b>  است که می‌توانند به شهرت  <b> چیستا </b>  و خدمات آن لطمه وارد نمایند و در بهره‌برداری از خدمات  <b> چیستا </b>  ممنوع هستند
                       .
                        </Typography>
                        <Typography>
                            راهنمایی‌ها و ممنوعیت‌های بیان شده در این توافق‌نامه در استفاده از خدمات  <b> چیستا </b>  توسط مشتری می‌بایست به همان اندازه توسط کارکنان مشتری و هر شخص حقیقی و حقوقی دیگری که به‌صورت مستقیم یا غیرستقیم و به واسطه مشتری به خدمات  <b> چیستا </b>  دسترسی پیدا نموده اند اعمال گردد. استفاده از خدمات  <b> چیستا </b>  به منزله مطالعه، آگاهی و پذیرش مشتری از تمامی مفاد این توافق‌نامه است و مشتری متعهد می‌گردد که کاربران و مخاطبین خود (مشتری) مطابق با مفاد این توافق‌نامه عمل خواهند نمود و در صورت نقض مفاد این توافق‌نامه توسط مشتری یا کاربران ایشان مسئولیت کامل عواقب ناشی از آن بر عهده مشتری است
                       . 
                        </Typography>
                        <h4>رفتار عمومی</h4>
                        <Typography>
                            مشتری می‌بایست از خدمات  <b> چیستا </b>  در موارد مجاز اعلام شده استفاده نماید. مشتری مجاز به اختصاص، انتقال، توزیع، فروش، اجاره و فراهم نمودن دسترسی به خدمات  <b> چیستا </b>  برای هیچ شخص ثالث دیگری که جزو نمایندگان یا کارکنان خود نیست را ندارد مگر در مواردی که رسما و صراحتا به صورت مکتوب از سوی  <b> چیستا </b>  مجاز شناخته شده باشند. مشتری تنها مجاز به استفاده از خدمات  <b> چیستا </b>  در راستای اهداف قانونی و مطابق با این توافق‌نامه است
                       .
                        </Typography>
                        <h4>مسئولیت محتوا</h4>
                        <Typography>
                             <b> چیستا </b>  هیچ‌گونه مسئولیتی در قبال محتوای ایجاد شده، فراهم شده و یا منتشر شده توسط مشتری یا کاربران مشتری را بر عهده ندارد.  <b> چیستا </b>  هیچ گونه نظارت و سیستم کنترلی را برای محتوای مشتریان و
                            کاربران آن ها که در رویدادها منتشر می گردند نداشته و مشتری در قبال موارد زیر به‌طور کامل مسئول است
                       :
                        </Typography>
                        <ol>
                            <li>
                                هرگونه محتوایی که توسط مشتری یا کاربران مشتری در بستر خدمات  <b> چیستا </b>  منتشر می گردند
                            </li>
                            <li>
                                انطباق محتوای منتشر شده با تمامی قوانین کپی رایت، انتشار و توزیع محتوا در جمهوری اسلامی ایران
                            </li>
                            <li>
                                تهیه پشتیان از محتوای خود جهت ارایه به مراجع قانونی و قضایی در صورت وجود هرگونه شکایت و یا دستور قضایی
                            </li>
                        </ol>
                        <h4>محتوای نامناسب و غیرقانونی</h4>
                        <Typography>
                            مشتری نباید از خدمات  <b> چیستا </b>  برای انتقال، توزیع، انتشار و نگهداری هرگونه محتوایی که از سوی  <b> چیستا </b>  نامناسب اعلام گردیده است و یا بر اساس قوانین جمهوری اسلامی ایران غیرقانونی، توهین آمیز، افترا آمیز، زشت و ناپسند، غیراخلاقی (پورن)، ضد دینی، نژادپرستانه و در تضاد با شرایط عمومی پذیرفته شده توسط جامعه اینترنتی باشد، استفاده نماید. مشتری موظف است اطمینان حاصل نماید که محتوای خود و کاربرانش هیچ یک از قوانین و آیین‌نامه‌های داخلی و خارجی شامل و نه محدود به ضوابط انتشار محتوا، کدگذاری، صادرات و هرگونه حق و حقوق اشخاص ثالث را نقض نمی‌نمایند. مشتری نمی‌بایست از خدمات  <b> چیستا </b>  برای انتشار محتوای حاوی ویروس، کرم، تورجان یا سایر برنامه‌های مخرب استفاده نماید
                       .
                        </Typography>
                        <h4>موارد نقض امنیت</h4>
                        <Typography>
                            نقض و یا تلاش برای نقض امنیت خدمات  <b> چیستا </b>  و یا هرنوع شبکه، سیستم، سرور و حساب کاربری اشخاص ثالث که شامل و نه محدود به موارد زیر می‌گردد از سوی مشتری و کاربران مشتری اکیدا ممنوع
                            است
                        :
                        </Typography>
                        <ol>
                            <li>
                                دسترسی به دیتا، اطلاعات، سرورها، حساب‌های کاربری، بانک‌های اطلاعاتی و…که مشتری مجاز به دسترسی به آن‌ها نیست
                            </li>
                            <li>
                                جعل هویت پرسنل  <b> چیستا </b>  و یا استفاده از هرگونه هویت جعلی
                            </li>
                            <li>
                                اقدام به کاوش، اسکن، تست و آنالیز آسیب‌پذیری سیستم‌ها، شبکه، سرورها و نقض امنیت و سیستم‌های احراز هویت
                            </li>
                            <li>
                                اقدام به ایجاد اختلال، مداخله و غیرفعال نمودن خدمات هر یک از کاربران، سرورها و شبکه‌ها شامل و نه محدود به حملات
                                "denial of service",
                                "overloading, "flooding," "mail bombing,"
                                 و یا 
                                 "Crashing"
                            </li>
                            <li>
                                هرگونه اقدامی برای در اختیار گرفتن خدمات، حساب کاربری و اطلاعات شخصی سایر مشتریان و کاربران
                            </li>
                            <li>
                                هرگونه اقدامی برای دور زدن یا تغییر سیستم مالی و صدور صورت‌حساب های خدمات
                            </li>
                        </ol>
                        <Typography>
                            نقض امنیت شبکه یا سیستم‌های  <b> چیستا </b>  مشمول مسئولیت کیفری و یا مدنی است و متخلف شدیدا تحت پیگیرد قانونی قرار خواهد گرفت
                       .
                        </Typography>
                    </div>
                    <div className={classes.privacyContentItem} ref={(el) => (privacyRefs.current[7] = el)}>
                        <h3 className={clsx(typography.fontFamB, classes.privacyItemTitle)}>حقوق و اقدامات  <b> چیستا </b> </h3>
                        <ul className={classes.ulNoStyle}>
                            <li>
                                اگر مشتری از هرگونه محتوا یا فعالیتی که موجب نقض مفاد این توافق‌نامه یا سایر توافق‌نامه‌های  <b> چیستا </b>  می‌گردد مطلع شود، می‌بایست موضوع را بلافاصله به  <b> چیستا </b>  اعلام نموده و تمامی اقدامات لازم برای پیشگیری از توزیع و انتشار و نگهداری آن در خدمات  <b> چیستا </b>  را به کار گیرد. درصورتی‌که  <b> چیستا </b>  از هرگونه محتوا و یا فعالیتی که بنا بر تشخیص  <b> چیستا </b>  موجب نقض قوانین و مفاد توافق‌نامه‌های  <b> چیستا </b>  گردد آگاه شود می‌تواند بلافاصله دسترسی به آن محتوا را مسدود نموده، خدمات مرتبط با آن را متوقف و یا قطع کرده و هرگونه اقدام دیگری را که بنا بر صلاحدید خود لازم بداند انجام خواهد داد. تاکید می‌گردد ملاک تشخیص محتوا و اقدامات ناقض مفاد توافق‌نامه‌ها صلاحدید  <b> چیستا </b>  است
                            </li>
                            <li>
                                 <b> چیستا </b>  حق توقف و یا مسدودسازی خدماتی را که ادامه آن ها منجر به نقض قوانین و وارد آمدن خسارت به خدمات، مشتریان و کاربران  <b> چیستا </b>  گردد را برای خود محفوظ می دارد
                            </li>
                            <li>
                                 <b> چیستا </b>  مجاز به همکاری با مراجع قانونی و اشخاص ثالث جهت انجام تحقیقات لازم در خصوص شناسایی عوامل متخلف بوده و می‌تواند هویت و اطلاعات شخصی افرادی را که در نقض قوانین و بروز خسارات مادی و معنوی مسئول می‌داند افشا نماید
                            </li>
                            <li>
                                 <b> چیستا </b>  پاسخگوی خسارات و عواقب ناشی از بهره‌مندی حقوق محفوظ خود در توافق‌نامه‌های  <b> چیستا </b>  از جمله مسدود نمودن حساب کاربری مشتری، قطع دسترسی به خدمات  <b> چیستا </b>  و حذف اطلاعات ذخیره شده توسط مشتری به واسطه استفاده از خدمات که متوجه مشتری، کاربران و یا اشخاص ثالث می‌گردد نخواهد بود
                            </li>
                        </ul>
                    </div>
                </div>
            </LayoutWithSidebar>
        </Layout>
    )
}

export default Terms;
